#usr/bin/python3
#_*_coding:UTF-8_*_


a1 = 10
b2 = 5
print (a1%b2)     # % 返回除数的余数
print (a1//b2)   #  // 取整除,返回商的整数部分

a2 = 60
b2 = 13
print ( a2 & b2)  # 同1为1    0011 1100（60） & 0000 1101（13） = 0000 1100（12）
print ( a2 | b2)  # 有1为1                                        0011 1101（61）
print ( a2 ^ b2)  # 两个对应的二进制位相异时,结果为1              0011 0001（49）
print ( ~ a2)     # 按位取反                                      1100 0011（-61）
print ( a2<< 2)     # 左移2位(高位丢弃,低位补0)                   1111 0000（240）
print ( a2>> 2)     # 右移                                        0000 1111（15）

#  运算符优先级
"""
**
~   +      -    
*   /    %   //
+    -
>>     <<
&
^     |
<=   <>      >=
<>    ==   !=
=    %=   /=   //=    -=   +=  *=     **=
is       is not
in       in not
not   or     and
"""


#  Unicode     ACSII    UTF-8之间的关系